{
	"title" : "Milkshake Guardian",
	"updated": "7/6/19",
	"objective" : "This project initially started as a joke. 2nd semester of my last year in high school I was taking an Advanced Studies class under one of my TSA advisors/teachers. The teacher normal taught a Game Design class so as an Advanced Studies student my role was to assist him in teaching the class and to perform research of my own (<a href='project.php?project=not_ready'>Research Project</a>). One Day, I was asked to build a game only using 1 button. The teacher wanted to test how complex of a game I could create and also wanted to see if that was a potentially viable project he could give his the students. I am very fond of milkshakes and during a random discussion, my advisor told me milkshakes are bad. As soon as he told me that, the idea clicked in my head, and I decided to make my 1 button game off the concept of our argument of if milkshakes are good or bad.",
	"results" : "The game came out rather successful, as it the whole was based off a joke, it was very popular among my peers. The game was built using the <a href='project.php?project=game_engine'>Game Engine</a> that I had previously developed. The game involved a character with my face fighting enemies, doing 2D platforming, and collecting milkshakes, all in order to fight the final boss and defend all milkshakes everywhere, all only using 1 mouse button, no keyboard interaction. After the success of the first game, I ended up building a part 2. The new game was one of the most complex I had ever built. It imployed many techqniues that I had never used before, including, Artifical 3D rendering, Custom mesh collsions, and Raytracing. The 2nd game was also built off my <a href='project.php?project=game_engine'>Game Engine</a> however due to these more advanced techniques the engine was not properly designed to handle them and the resulting game required a lot of CPU to play correctly. A 3rd version of the game is currently in development using the Unity game engine. The use of Unity allows for proper 3D gameplay and great potential for features in the game.",
	"learned" : "The first version of the game was not meant for me to learn from and only used basic Java concepts that I have learned long ago. The 2nd version of the game taught me more than most of my other projects. I learned many things in regards to creating more advanced gameplay and was able to learn how stable and large game engines like Unity or Unreal handle their games. The 3rd version of the game has only just started and will likely continue for a while, however, it has already taught me a lot regarding C# game development with Unity and how to use Unity in general."
}
